FL0WL0W/EmbeddedIOServices/test/src/ATTiny427_PassthroughServiceTests.cpp
#include "gmock/gmock.h"
#include "gtest/gtest.h"
#include "ATTiny427_PassthroughService.h"
#include "ATTiny427_EVSYSService.h"
#include "ATTiny427_ExpanderService.h"
#include <cstring>

using namespace testing;
using namespace EmbeddedIOServices;

namespace ATTiny427_PassthroughServiceTests
{
    struct TestCase
    {
        ATTiny427_ExpanderComm commType;
        digitalpin_t pinIn;
        bool inverted;
        bool useAC;
    };

    class ATTiny427_PassthroughServiceTest : public ::testing::TestWithParam<TestCase>
    {
    protected:
        TestCase testCase;
        std::unique_ptr<ATTiny427_ExpanderService> expanderService;
        std::unique_ptr<ATTiny427_EVSYSService> evsysService;
        std::unique_ptr<ATTiny427_PassthroughService> passthroughService;
        uint8_t transmitBuffer[256];
        uint8_t evsysChannel;
        uint8_t evsysChannelGenerator;
        bool useAC;
        
        void SetUp() override
        {
            testCase = GetParam();
            useAC = testCase.useAC && (testCase.pinIn == 7 || testCase.pinIn == 13 || testCase.pinIn == 9 || testCase.pinIn == 14);
            if(useAC)
                evsysChannel = 0;
            else if(testCase.pinIn < 8)
                evsysChannel = 0;
            else if(testCase.pinIn < 16)
                evsysChannel = 4;
            else if(testCase.pinIn < 22)
                evsysChannel = 2;
            else
                evsysChannel = 0xFF; //invalid
            evsysChannelGenerator = useAC ? 0x20 : (0x40 | (testCase.pinIn & 0x7));

            expanderService = std::make_unique<ATTiny427_ExpanderService>(testCase.commType);
            evsysService = std::make_unique<ATTiny427_EVSYSService>(expanderService.get());
            passthroughService = std::make_unique<ATTiny427_PassthroughService>(expanderService.get(), evsysService.get());
        }

        void CheckACSetup(uint8_t &idx, uint8_t pinOut)
        {
            if(!useAC)
                return;

            //setup AC if needed
            ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_AC0_DACREF >> 8); //address high byte
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_AC0_DACREF & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], 0x85);

            uint8_t AC_MUXCTRLA;
            uint8_t AC_CTRLA = 0b10000111;
            switch(testCase.pinIn)
            {
                case 7:
                    AC_MUXCTRLA = 0x03;
                    break;
                case 9:
                    AC_MUXCTRLA = 0x03 | (0x2 << 3);
                    break;
                case 13:
                    AC_MUXCTRLA = 0x03 | (0x1 << 3);
                    break;
                case 14:
                    AC_MUXCTRLA = 0x03 | (0x3 << 3);
                    break;
                default:
                    return;
            }
            if(pinOut == 5)
            {
                AC_MUXCTRLA |= testCase.inverted? 0b10000000 : 0;
                AC_CTRLA |= 0b01000000; //enable output
            }
            
            ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high address
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_AC0_MUXCTRLA & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], AC_MUXCTRLA);

            ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high address
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_AC0_CTRLA & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], AC_CTRLA);
        }
    };

    std::list<TestCase> CreateTestCases()
    {
        std::list<TestCase> testCases;
        for(auto commType : {ATTiny427_ExpanderComm_UART0, ATTiny427_ExpanderComm_UART0Alternate, ATTiny427_ExpanderComm_UART1, ATTiny427_ExpanderComm_UART1Alternate, ATTiny427_ExpanderComm_SPI, ATTiny427_ExpanderComm_SPIAlternate})
        {
            for(digitalpin_t pinIn = 0; pinIn < 23; pinIn++)
            {
                for(bool inverted : {false, true})
                {
                    for(bool useAC : {false, true})
                    {
                        testCases.push_back({commType, pinIn, inverted, useAC});
                    }
                }
            }
        }
        return testCases;
    }

    INSTANTIATE_TEST_SUITE_P(
        ATTiny427_PassthroughServiceTest,
        ATTiny427_PassthroughServiceTest,
        ::testing::ValuesIn(CreateTestCases())
    );

    TEST_P(ATTiny427_PassthroughServiceTest, WhenInitPassthrough_InPinDeinittedCorrectly)
    {
        const digitalpin_t pinOut = testCase.pinIn == 15? 10 : 15;
        if(pinOut == 10 && testCase.commType == ATTiny427_ExpanderComm_UART0)
        {
            SCOPED_TRACE(testing::Message() << "UnsupportedPassthrough: " << testCase.commType);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, pinOut, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }
        //initdeinit so registers are known state
        passthroughService->InitPassthrough(testCase.pinIn, pinOut, testCase.inverted, testCase.useAC);
        passthroughService->DeinitPassthrough(pinOut);
        expanderService->Transmit(transmitBuffer);

        if(!passthroughService->InitPassthrough(testCase.pinIn == 7? 13 : 7, testCase.pinIn, testCase.inverted, testCase.useAC))
        {
            //if init failed, nothing should be transmitted
            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        //we don't care about this init, so just clear out the commands with a transmit
        expanderService->Transmit(transmitBuffer);

        //lets just use EVOUTB for testing since all comms have it
        bool result = passthroughService->InitPassthrough(testCase.pinIn, pinOut, testCase.inverted, testCase.useAC);
        ASSERT_TRUE(result);

        const size_t endPadding = 3+(testCase.inverted? 4 : 0)+(useAC? 10 : 0);
        const size_t size = expanderService->Transmit(transmitBuffer);
        ASSERT_GE(size, endPadding + 8);
        for(uint8_t idx = 0; idx < size-2; idx++)
        {
            //look for EVOUTB setup
            if( transmitBuffer[idx] == 0xA1 &&
                transmitBuffer[idx + 1] == (ADDRESS_EVSYS_EVOUTB & 0xFF) &&
                transmitBuffer[idx + 2] == (evsysChannel + 1))
            {
                ASSERT_EQ(idx, size-endPadding);
                return;
            }
        }
        ASSERT_TRUE(false) << "EVOUTB setup not found in transmitted data";
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenInitPassthroughToPin2_ThenEVOUTAIsConfiguredCorrectly)
    {
        if(testCase.pinIn == 2)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 2, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

