FL0WL0W/EmbeddedIOServices/test/src/ATTiny427_PassthroughServiceTests.cpp
        if(testCase.commType == ATTiny427_ExpanderComm_SPI || 
            testCase.commType == ATTiny427_ExpanderComm_UART0Alternate || 
            testCase.commType == ATTiny427_ExpanderComm_UART1)
        {
            SCOPED_TRACE(testing::Message() << "UnsupportedPassthrough: " << testCase.commType);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 2, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 2, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        SCOPED_TRACE(testing::Message() << "SupportedPassthrough: " << testCase.commType);

        bool result = passthroughService->InitPassthrough(testCase.pinIn, 2, testCase.inverted, testCase.useAC);
        ASSERT_TRUE(result);

        const size_t size = expanderService->Transmit(transmitBuffer);
        uint8_t idx = 0;
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTMUX_EVSYSROUTEA >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTMUX_EVSYSROUTEA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0x00); //this is the primary EVOUTA mapping
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], evsysChannelGenerator); //generator set to pinIn
        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_EVOUTA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], evsysChannel + 1); //set EVOUTA to channel
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTA_PINCTRL(2) >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTA_PINCTRL(2) & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], testCase.inverted ? 0x80 : 0x00); //inverted or not

        CheckACSetup(idx, 2);
        ASSERT_EQ(size, idx);
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenDeinitPassthroughToPin2_ThenEVOUTADeconfiguredCorrectly)
    {
        if(testCase.pinIn == 2)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

        bool result = passthroughService->InitPassthrough(testCase.pinIn, 2, testCase.inverted, testCase.useAC);

        if(testCase.commType == ATTiny427_ExpanderComm_SPI || 
            testCase.commType == ATTiny427_ExpanderComm_UART0Alternate || 
            testCase.commType == ATTiny427_ExpanderComm_UART1)
        {
            SCOPED_TRACE(testing::Message() << "UnsupportedPassthrough: " << testCase.commType);
            ASSERT_FALSE(result);
            return;
        }

        SCOPED_TRACE(testing::Message() << "SupportedPassthrough: " << testCase.commType);
        ASSERT_TRUE(result);

        expanderService->Transmit(transmitBuffer);

        passthroughService->DeinitPassthrough(2);

        const size_t size = expanderService->Transmit(transmitBuffer);
        uint8_t idx = 0;
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_EVOUTA >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_EVOUTA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0); //set EVOUTA to 0 disabled
        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high addr
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0); //generator set to 0 (disabled)
        if(testCase.inverted)
        {
            ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTA_PINCTRL(2) >> 8); //address high byte
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTA_PINCTRL(2) & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], 0x00); //remove inverted
        }

        ASSERT_EQ(size, idx);
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenInitPassthroughToPin4_ThenLUT0IsConfiguredCorrectly)
    {
        if(testCase.pinIn == 4)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 4, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        if(testCase.commType == ATTiny427_ExpanderComm_SPI)
        {
            SCOPED_TRACE(testing::Message() << "UnsupportedPassthrough: " << testCase.commType);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 4, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 4, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

