FL0WL0W/EmbeddedIOServices/test/src/ATTiny427_PassthroughServiceTests.cpp
        ASSERT_EQ(size, idx);
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenDeinitPassthroughToPin5_ThenLUT3DeconfiguredCorrectly)
    {
        if(testCase.pinIn == 5)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

        SCOPED_TRACE(testing::Message() << "SupportedPassthrough: " << testCase.commType);

        bool result = passthroughService->InitPassthrough(testCase.pinIn, 5, testCase.inverted, testCase.useAC);
        ASSERT_TRUE(result);

        expanderService->Transmit(transmitBuffer);

        const bool usesEVSYS = *evsysService->EVSYS_CCL_LUT3A != 0;

        passthroughService->DeinitPassthrough(5);

        const size_t size = expanderService->Transmit(transmitBuffer);
        uint8_t idx = 0;
        if(useAC)
        {
            ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_AC0_CTRLA >> 8); //address high byte
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_AC0_CTRLA & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], 0b10000111); //set CCL_CTRLA to 0 disabled
            ASSERT_EQ(size, idx);
            return;
        }
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0x40); //set CCL_CTRLA to 0 disabled
        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_LUT3CTRLA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0x00); //set CCL_CTRLA to 0 disabled
        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CCL_LUT3A & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0); //set EVSYS to 0 disabled
        if(usesEVSYS)
        {
            ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high addr
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], 0); //generator set to 0 (disabled)
        }

        ASSERT_EQ(size, idx);
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenInitPassthroughToPin7_ThenEVOUTAIsConfiguredCorrectly)
    {
        if(testCase.pinIn == 7)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 7, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        if(testCase.commType == ATTiny427_ExpanderComm_SPIAlternate || 
            testCase.commType == ATTiny427_ExpanderComm_UART1Alternate)
        {
            SCOPED_TRACE(testing::Message() << "EVOUTA for Pin7 not on: " << testCase.commType);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 7, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        SCOPED_TRACE(testing::Message() << "SupportedPassthrough: " << testCase.commType);

        bool result = passthroughService->InitPassthrough(testCase.pinIn, 7, testCase.inverted, testCase.useAC);
        ASSERT_TRUE(result);

        const size_t size = expanderService->Transmit(transmitBuffer);
        uint8_t idx = 0;
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTMUX_EVSYSROUTEA >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTMUX_EVSYSROUTEA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0x01); //this is the alternate EVOUTA mapping
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], evsysChannelGenerator); //generator set to pinIn
        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_EVOUTA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], evsysChannel + 1); //set EVOUTA to channel
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTA_PINCTRL(7) >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTA_PINCTRL(7) & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], testCase.inverted ? 0x80 : 0x00); //inverted or not

        CheckACSetup(idx, 7);
        ASSERT_EQ(size, idx);
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenDeinitPassthroughToPin7_ThenEVOUTADeconfiguredCorrectly)
    {
        if(testCase.pinIn == 7)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

        if(testCase.commType == ATTiny427_ExpanderComm_SPIAlternate || 
            testCase.commType == ATTiny427_ExpanderComm_UART1Alternate)
        {
            SCOPED_TRACE(testing::Message() << "EVOUTA for Pin7 not on: " << testCase.commType);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

