FL0WL0W/EmbeddedIOServices/test/src/ATTiny427_PassthroughServiceTests.cpp
        SCOPED_TRACE(testing::Message() << "SupportedPassthrough: " << testCase.commType);
        ASSERT_TRUE(result);

        expanderService->Transmit(transmitBuffer);

        passthroughService->DeinitPassthrough(10);

        const size_t size = expanderService->Transmit(transmitBuffer);
        uint8_t idx = 0;
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_EVOUTB >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_EVOUTB & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0); //set EVOUTB to 0 disabled
        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high addr
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0); //generator set to 0 (disabled)
        if(testCase.inverted)
        {
            ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTB_PINCTRL(2) >> 8); //address high byte
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTB_PINCTRL(2) & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], 0x00); //remove inverted
        }

        ASSERT_EQ(size, idx);
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenInitPassthroughToPin11_ThenLUT2IsConfiguredCorrectly)
    {
        if(testCase.pinIn == 11)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 11, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        if(testCase.commType == ATTiny427_ExpanderComm_UART0)
        {
            SCOPED_TRACE(testing::Message() << "UnsupportedPassthrough: " << testCase.commType);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 11, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 11, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        SCOPED_TRACE(testing::Message() << "SupportedPassthrough: " << testCase.commType);

        bool result = passthroughService->InitPassthrough(testCase.pinIn, 11, testCase.inverted, testCase.useAC);
        ASSERT_TRUE(result);

        const size_t size = expanderService->Transmit(transmitBuffer);
        uint8_t idx = 0;
        if(useAC)
        {
            CheckACSetup(idx, 11);
            ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA >> 8); //address high byte
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], 0x00); //turn off CCL to configure

            ASSERT_EQ(transmitBuffer[idx++], 0xA3); //write 1 byte with 16 bit address with existing high address
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_LUT2CTRLB & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], 0x66); 
            ASSERT_EQ(transmitBuffer[idx++], 0x00); 
        }
        else
        {
            switch(testCase.pinIn)
            {
                case 8: 
                    ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA >> 8); //address high byte
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], 0x00); //turn off CCL to configure

                    ASSERT_EQ(transmitBuffer[idx++], 0xA3); //write 1 byte with 16 bit address with existing high address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_LUT2CTRLB & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], 0x05); 
                    ASSERT_EQ(transmitBuffer[idx++], 0x00); 
                    break;
                case 9:
                    ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA >> 8); //address high byte
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], 0x00); //turn off CCL to configure

                    ASSERT_EQ(transmitBuffer[idx++], 0xA3); //write 1 byte with 16 bit address with existing high address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_LUT2CTRLB & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], 0x50); 
                    ASSERT_EQ(transmitBuffer[idx++], 0x00); 
                    break;
                case 10:
                    ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA >> 8); //address high byte
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], 0x00); //turn off CCL to configure

                    ASSERT_EQ(transmitBuffer[idx++], 0xA3); //write 1 byte with 16 bit address with existing high address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_LUT2CTRLB & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], 0x00); 
                    ASSERT_EQ(transmitBuffer[idx++], 0x05); 
                    break;
                default:
                    ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) >> 8); //address high byte
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], evsysChannelGenerator); //generator set to pinIn
                    ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CCL_LUT2A & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], evsysChannel + 1); //set EVOUTA to channel

                    ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], 0x00); //turn off CCL to configure

                    ASSERT_EQ(transmitBuffer[idx++], 0xA3); //write 1 byte with 16 bit address with existing high address
                    ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_LUT2CTRLB & 0xFF); //address low byte
                    ASSERT_EQ(transmitBuffer[idx++], 0x03); 
                    ASSERT_EQ(transmitBuffer[idx++], 0x00); 
                    break;
            }
        }
        ASSERT_EQ(transmitBuffer[idx++], testCase.inverted? 0x1 : 0xFE);

        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTMUX_CCLROUTEA >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTMUX_CCLROUTEA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0x00); //this is the primary LUT2 output

        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_LUT2CTRLA >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_LUT2CTRLA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0x41); //turn on CCL LUT2

        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0x41); //turn on CCL

