FL0WL0W/EmbeddedIOServices/test/src/ATTiny427_PassthroughServiceTests.cpp
        ASSERT_EQ(size, idx);
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenDeinitPassthroughToPin17_ThenLUT1DeconfiguredCorrectly)
    {
        if(testCase.pinIn == 17)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

        bool result = passthroughService->InitPassthrough(testCase.pinIn, 17, testCase.inverted, testCase.useAC);
        if(testCase.commType == ATTiny427_ExpanderComm_SPIAlternate || testCase.commType == ATTiny427_ExpanderComm_UART1Alternate)
        {
            SCOPED_TRACE(testing::Message() << "UnsupportedPassthrough: " << testCase.commType);
            ASSERT_FALSE(result);
            return;
        }

        SCOPED_TRACE(testing::Message() << "SupportedPassthrough: " << testCase.commType);
        ASSERT_TRUE(result);

        expanderService->Transmit(transmitBuffer);

        const bool usesEVSYS = *evsysService->EVSYS_CCL_LUT1A != 0;

        passthroughService->DeinitPassthrough(17);

        const size_t size = expanderService->Transmit(transmitBuffer);
        uint8_t idx = 0;
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_CTRLA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0x40); //set CCL_CTRLA to 0 disabled
        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_CCL_LUT1CTRLA & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0x00); //set CCL_CTRLA to 0 disabled
        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CCL_LUT1A & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], 0); //set EVSYS to 0 disabled
        if(usesEVSYS)
        {
            ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high addr
            ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) & 0xFF); //address low byte
            ASSERT_EQ(transmitBuffer[idx++], 0); //generator set to 0 (disabled)
        }

        ASSERT_EQ(size, idx);
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenInitPassthroughToPin18_ThenEVOUTCIsConfiguredCorrectly)
    {
        if(testCase.pinIn == 18)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 18, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        if(testCase.commType == ATTiny427_ExpanderComm_SPIAlternate || 
            testCase.commType == ATTiny427_ExpanderComm_UART1Alternate)
        {
            SCOPED_TRACE(testing::Message() << "UnsupportedPassthrough: " << testCase.commType);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 18, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            const bool result = passthroughService->InitPassthrough(testCase.pinIn, 18, testCase.inverted, testCase.useAC);
            ASSERT_FALSE(result);

            const size_t size = expanderService->Transmit(transmitBuffer);
            ASSERT_EQ(size, 0);
            return;
        }

        SCOPED_TRACE(testing::Message() << "SupportedPassthrough: " << testCase.commType);

        bool result = passthroughService->InitPassthrough(testCase.pinIn, 18, testCase.inverted, testCase.useAC);
        ASSERT_TRUE(result);

        const size_t size = expanderService->Transmit(transmitBuffer);
        uint8_t idx = 0;
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_CHANNEL(evsysChannel) & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], evsysChannelGenerator); //generator set to pinIn
        ASSERT_EQ(transmitBuffer[idx++], 0xA1); //write 1 byte with 16 bit address with existing high address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_EVSYS_EVOUTC & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], evsysChannel + 1); //set EVOUTB to channel
        ASSERT_EQ(transmitBuffer[idx++], 0x81); //write 1 byte with 16 bit address
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTC_PINCTRL(2) >> 8); //address high byte
        ASSERT_EQ(transmitBuffer[idx++], ADDRESS_PORTC_PINCTRL(2) & 0xFF); //address low byte
        ASSERT_EQ(transmitBuffer[idx++], testCase.inverted ? 0x80 : 0x00); //inverted or not

        CheckACSetup(idx, 18);
        ASSERT_EQ(size, idx);
    }

    TEST_P(ATTiny427_PassthroughServiceTest, WhenDeinitPassthroughToPin18_ThenEVOUTCDeconfiguredCorrectly)
    {
        if(testCase.pinIn == 18)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

        if(testCase.pinIn > 21)
        {
            SCOPED_TRACE(testing::Message() << "InvalidPin: " << testCase.pinIn);
            return;
        }

        bool result = passthroughService->InitPassthrough(testCase.pinIn, 18, testCase.inverted, testCase.useAC);

        if(testCase.commType == ATTiny427_ExpanderComm_SPIAlternate || 
            testCase.commType == ATTiny427_ExpanderComm_UART1Alternate)
        {
            SCOPED_TRACE(testing::Message() << "UnsupportedPassthrough: " << testCase.commType);
            ASSERT_FALSE(result);
            return;
        }

